tutorials/multiLayerPBF/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam);

beam
{
    pathName            scanPath;
 
    absorptionModel     Kelly;    
    KellyCoeffs
    {
        geometry        cone;
        eta0            0.28;
        etaMin          0.35;
    }   

    heatSourceModel     modifiedSuperGaussian;
    modifiedSuperGaussianCoeffs
    {
        dimensions      (40.0e-6 40.0e-6 30e-6);
        m               2.72;
        k               7.95;
        transient       true;
        nPoints         (10 10 10);
    }
}

refinementModel
{
    refinementModel         none;

    //refinementModel         targetCellLoad;
    
    refinementTemperature   1000;

    buffers
    {
        beam                (85.0e-6 85.0e-6 150e-6);
    }

    targetCellLoadCoeffs
    {
        targetCellsPerProc  5000;
        nBufferVolumes      4;
        maxSearchIter       10;
        timeTolerance       1e-4;
    }
}

// ************************************************************************* //
